//Задача 1
// alert("Здарова)))")
//Задача 2
// a = 158;
// b = 2;
// alert(a+b)

// Задача 3
// let name="Алевтина"
// alert (`Привет, ${ name}`);

// Задача 4
// let name=prompt("Как вас зовут? ")
//  alert (`Привет,${ name}`);

// Задача 5
// let name="пользователь"
// alert(`Привет, ${ name}`);
// let secondN=prompt("Как вас зовут? ")
//  alert(`Привет,${secondN}`);

// Задача 6
// let test = confirm("Правы?")? alert("Мы рады что вы уверены") : alert("Жаль что вы не уверены(");

// Задача 7

    

    // if (age == 18) {
    //     alert('Вы совершеннолетний, все можно!');
    // } else if (age == 10) {
    //     alert('Вам надо учить уроки!');
    // } else if (age == 30) {
    //     alert('Ложитесь спать, завтра на работу');
    // } else {
    //     alert('Мы не знаем что Вам делать');
    // }

    // let age = parseInt(prompt("Сколько вам лет?"));

    // switch(age) {
    //     case 10:  alert('Вам надо учить уроки!');
    //     break;
    //     case 18:  alert('Вы совершеннолетний, все можно!');
    //     break;
    //     case 30: alert('Ложитесь спать, завтра на работу');
    //     break;
    //     default: alert('Мы не знаем что Вам делать');
    // }


// Задача 8

// var m = (5,4,3,2,1);
// m.sort(); // сортировка массива
// alert(m); 





















































































